Vue.component('prehead',{
	template:'#prehead',
	data:function(){
		return {
			curUser:window.localStorage.username,
			menu:[
					['家常菜谱','家常菜','凉菜','素食','晚餐','私家菜','热菜','海鲜','孕妇','早餐','午餐','甜品点心','汤粥','宝宝食谱-婴儿食谱','糕点主食','微波炉'],
					['中华菜系','川菜','粤菜','东北菜','湘菜','鲁菜','浙菜','湖北菜','清真菜'],
					['各地小吃', '四川小吃',	'广东小吃',	'北京小吃',	'陕西小吃'],
					['外国菜谱','韩国料理','日本料理','法国菜意大利餐'],
					['烘焙','蛋糕面包','饼干配方','甜品点心'],
					['厨房百科' ,'摆盘围边','烹饪技巧','生活妙招','美食专题'],
					['食材','百科','蔬菜','水果','谷类']
				],
		healthfood:	[
						['饮食健康','饮食小常识','美容瘦身','食品安全','养生妙方','饮食禁忌','中医保健','母婴健康饮食','饮食新闻'],
						['功能','性调理','清热去火','减肥','祛痰','乌发','滋阴补肾','健脾开胃','消化不良','清热解毒','补阳壮阳','增肥'],
						['人群膳食','孕妇','老人','产妇','哺乳期','青少年','幼儿','学龄期儿童'],
						['疾病调理','糖尿病','高血压','痛风','胃炎','痔疮','更年期','甲状腺'],
						['脏腑调理','感冒','补肾','阳痿','早泄','补血','便秘','腹泻','活血化瘀']
				]
		}
	},
	// beforeDestroy:function(){
	// 	// var store = [];
	// 	// store = window.localStorage.username;
	// 	// for(var i=0;i<this.store.length;i++){

	// 	// }
	// 	localStorage.clear();

	// },
	methods:{
		clearUser:function(){
			localStorage.clear();
		}
	}

})